In [48]:
import pandas as pd
import numpy as np
from statistics import mean

**Question 1 :** Write a program to create a list of names; then define a function to display all the elements in the received list. Call the function to execute its statements and display all names in the list. (Names: Ahmed, Ali, Salim, Abdullah, and Salwa)

In [41]:
name = ['Ahmed','Ali','Salim','Abdullah','Salwa']
def show_list(name):
    for i in range(len(name)):
        print("List value index %s"%i,name[i])
    print(name)

In [42]:
show_list(name)

List value index 0 Ahmed
List value index 1 Ali
List value index 2 Salim
List value index 3 Abdullah
List value index 4 Salwa
['Ahmed', 'Ali', 'Salim', 'Abdullah', 'Salwa']

**Question 2 :** Write a program to create a series to maintain five students’ names above and GPA values. (GPA: 2.5, 3.0, 2.5, 3.5, 4.0)

In [43]:
GPA = pd.Series([2.5,3.0,2.5,3.5,4.0],index=name)
GPA

Ahmed       2.5
Ali         3.0
Salim       2.5
Abdullah    3.5
Salwa       4.0
dtype: float64

**Question 3 :** Write a program to create a data frame to maintain three students’ names associated with their grades in three courses and then add a new column named Mean to maintain the calculated mean mark per course. Display the final data frame.

In [45]:
point = {'Ahmed':[65,60,78],'Ali':[70,78,80],'Salim':[69,68,72],'Abdullah':[75,80,84],'Salwa':[92,94,98]}
name_course = ['Course1','Course2','Course3']
df = pd.DataFrame(point,index=name_course)
df

         Ahmed  Ali  Salim  Abdullah  Salwa
Course1     65   70     69        75     92
Course2     60   78     68        80     94
Course3     78   80     72        84     98

In [56]:
df['Mean'] = df.mean(numeric_only=True,axis=1) #because axis the value can return
df

         Ahmed  Ali  Salim  Abdullah  Salwa  Mean
Course1     65   70     69        75     92  74.2
Course2     60   78     68        80     94  76.0
Course3     78   80     72        84     98  82.4